// 1) Привет
// 2) методы у массивов: 
// arr.push(), arr. arr.delele()

// 3) Как работает async / await ?

// 4) Что такое Event Loop ?

// 5) Что такое база данных ? - сбор информации

// 6) Какое значение this принимает у функций ?
// this примает значение смотря где он вызывается, если стрелочные функции, тогда вызывается там, где создался

// 7) Что такое __proto__ ?
// __proto__ - прототип, цепочка позволяет объктам наследовать функции друг от друга

// 8) Чем отличаются let, const ?
// в обеих случаях создаются переменные. 
// в const не можем изменить название, но значение можем изменить 

// 9) Что такое EcmaScript , чего нового он принес в JS ? приведите примеры

// 10) Что такое очередь, стек ?
// очередь - первый зашел, последний вышел

// 11) Что такое npm ? что он умеет ?
// npm - менеджер пакетов, с его помощью скачиваем пакеты из облачного сервера

// 12) Что такое GIT, GitHub ? 
// GIT - инмтрумент, GITHUB - сервер для проектов

// 13) Что делает команда git pull ? 
// вытаскиваем данные из сервера

// 14) Как создать ветку в Git ?
// git checkout dev

// 15) Как стянуть изменения с светки на удаленном репозитории (например GitHub)

// 16) Что такое HTTP ? по какому принципу он работает ?
// протокол передачи данных, "клиент" запрашивет "сервет" отвечает

// 17) Какие коды ответов HTTP вы знаете ? перечислите их

// 18) Что такое заголовки запроса ? 
// header

// 19) Что делает функция require() в NodeJs ?

// 20) Что такое модуль ? приведите пример


